# ============================================
# ЭТАП 1: СБОРКА ПРИЛОЖЕНИЯ
# ============================================
FROM golang:1.26.1-alpine AS builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файлы зависимостей (чтобы кэшировать их отдельно)
COPY go.mod go.sum ./

# Скачиваем зависимости (если они изменились — этот шаг пересоберётся)
RUN go mod download

# Копируем весь остальной код
COPY . .

# Собираем бинарный файл
# -o main — имя выходного файла
# ./cmd/main.go — путь к точке входа
RUN CGO_ENABLED=0 GOOS=linux go build -a -installsuffix cgo -o main ./cmd/main.go


# ============================================
# ЭТАП 2: ЗАПУСК ПРИЛОЖЕНИЯ
# ============================================
FROM alpine:latest

# Устанавливаем рабочую директорию
WORKDIR /root/

# Копируем только собранный бинарник из этапа сборки
COPY --from=builder /app/main .

# Открываем порт (для документации — не обязательно, но полезно)
EXPOSE 8080

# Команда, которая выполнится при запуске контейнера
CMD ["./main"]